<!doctype html>
<html>
<head>
	<title>MAINCAST.TV</title>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="icon" type="image/x-icon" href="https://www.dropbox.com/scl/fi/rqyp8lwf0zpxw3l8oytdt/favicon.ico?rlkey=rt0b30mz6yobaumnadx5cl4s9&st=h3vdq969&raw=1">
  <script src="https://cdn.tailwindcss.com"></script>
  <script>
	  tailwind.config = {
		theme: {
		  extend: {
			colors: {
			  	clifford: '#da373d',
				gray: {
					100: '#617E9D',
					
					300: '#3C4E65',
					400: '#2E3D50',
					500: '#262F3F',
					600: '#1F2633',
					700: '#181D28',
					800: '#10131B',
					900: '#0A0C10',
					950: '#000000'
				},
				blue: {
				  100: '#CDF5FF',
				  200: '#A3EBFF',
				  300: '#84E2FF'
				},
				white: {
					200: '#EEF2F6'
				}
			},
			fontFamily: {
  		  		sans: 'Geologica, sans-serif'
			},
			fontSize: {
			  temp: ['20px', '24px']
			},
			gridTemplateColumns: {
				temp: 'minmax(0, 1fr) 25rem'
			},
			gridTemplateRows: {
				temp: 'auto auto minmax(0, 1fr) auto',
				// Simple 16 row grid
				'16': 'repeat(16, minmax(0, 1fr))',
			
				// Complex site-specific row configuration
				'layout': '200px minmax(900px, 1fr) 100px',
			  }
		  }
		}
	  }
	</script>
	<style>
		@import url('https://fonts.googleapis.com/css2?family=Geologica:wght@100..900&display=swap');
		
		*::-webkit-scrollbar {
		  width: 4px;
		}
		
		*::-webkit-scrollbar-track {
		  background: #0A0C10;
		}
		
		*::-webkit-scrollbar-thumb {
		  background-color: #617E9D;
		}

	</style>
	<script src="https://unpkg.com/vue@3/dist/vue.global.js"></script>
</head>
<body class="bg-gray-600" onload="temp()">
	
	<div class="h-screen grid grid-rows-temp">
		
		
		<header class="pl-3 md:pl-6 flex flex-row items-center justify-between">
			<img class="h-4 md:h-5" src="https://www.dropbox.com/scl/fi/tzovk80jhhab39cugs1c6/logo.svg?rlkey=xc0zfhurcle574jau72e1o01v&st=9nh8gsic&raw=1" />
			
			
			
			<div class="w-[25rem] hidden md:flex flex-row">
				<a href="#" class="flex-1 flex justify-center items-center gap-3 p-3.5 text-sm font-medium text-white-200 bg-gray-900 hover:bg-gray-800 active:bg-gray-950">
					<img src="https://www.dropbox.com/scl/fi/wgcbt8l6m0y7gv8blt10y/maincast-icon.svg?rlkey=gekfcimjvbe9gbu56njoa9f24&st=iqe6sqol&raw=1" />
					<span><span class="uppercase">maincast</span>.com</span>
					<img src="https://www.dropbox.com/scl/fi/bmzdw0jdxifs3vvqskx74/arrow-up-right-icon.svg?rlkey=hql6mympg84qk2l3j7ziha5h8&st=0foyk94h&raw=1" />
				</a>
				<a href="#" class="flex-1 flex justify-center items-center gap-3 p-3.5 text-sm font-medium text-gray-900 bg-blue-200 hover:bg-blue-100 active:bg-blue-300">
					<img src="https://www.dropbox.com/scl/fi/thmynsf6zvsuzeve1tc6h/afu-icon.svg?rlkey=0r20pjbhc5wpqazifiyccaq83&st=aeuf3xg8&raw=1" />
					<span class="uppercase">Підтримати ЗСУ</span>
				</a>
			</div>
			
			
			<button class="flex md:hidden justify-center items-center gap-3 p-3.5 text-sm font-medium bg-gray-400 hover:bg-gray-300 active:bg-gray-500">
				<img src="https://www.dropbox.com/scl/fi/5uwc3k8xkz29zkvl34nj7/menu-icon.svg?rlkey=ssllvo5inqqw3blyy4k8r4w4w&st=yno6qqlf&raw=1" />
			</button>
		</header>

		<div class="flex flex-col xl:flex-row items-start xl:items-center gap-4 xl:gap-6 px-3 xl:px-6 py-4 bg-gray-700">
			
			<a href="#" class="grow-0 flex rounded-md justify-center items-center p-2 text-white-200 bg-gray-400 hover:bg-gray-300 active:bg-gray-500">
				<img src="https://www.dropbox.com/scl/fi/98r3xouo0e8stt22k7hrw/arrow-left.svg?rlkey=xznqsn5nvof07ui6958va4y6w&st=12ktd5vg&raw=1" />
			</a>
			
			<p class="grow text-white-200 text-2xl font-medium">Політика конфіденційності компанії «Maincast Limited»</p>
			<p class="text-gray-100 text-sm font-light">Версія: 2.0 Дата: 26 Серпня, 2020</p>
			
		</div>
		
		<div class="grow flex relative bg-gray-800">
			<div class="shrink-0 hidden md:block w-[376px] pl-6 py-6 overflow-y-scroll">
				<ul class="text-gray-100 text-sm font-light">
					<li class="py-2">1. <a href="#huh" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#kek" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#lol" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
					<li class="py-2">1. <a href="#" class="hover:text-blue-200 active:text-blue-300">Вступ</a></li>
				</ul>
			</div>
			<div class="px-3 py-4 md:p-6 space-y-6 overflow-y-scroll relative">
				
				<div class="space-y-4" id="huh">
					<p class="text-white-200 text-2xl font-medium">1. Вступ</p>
					<p class="text-gray-100 text-sm font-light">Компанія “Maincast Limited”, зареєстрована за номером HE 386802, з наступною юридичною адресою: Продмоу 75, Ванвью Парквью хаус (Prodromou, 75, Oneworld Parkview house), поверх 3, офіс 304, 2063, Нікосія, Кіпр, разом з її дочірніми компаніями (афілійованими особами), філіями, співробітниками, посадовими особами та директорами в залежності від ситуації (надалі за текстом іменуються як “Maincast”, “Компанія”, “ми”, “нас”, “наш”), є компанією, яка надає послуги з організації кіберспортивних заходів, що разом із функціями та послугами, які надаються, визначаються та надалі за текстом іменуються як “Послуги”.
					<br />
					<br />
					Компанія поважає конфіденційність своїх користувачів (надалі за текстом іменуються як “ви”, “ваш”). Ми вважаємо важливим, щоб ви приймали обґрунтовані рішення щодо використання наших Послуг на основі вашого розуміння, яку саме інформацію ми збираємо при використанні нашого Веб-сайту, що ми робимо з такою інформацією, як ми її обробляємо, яким особам ми її передаємо, а також щодо ваших прав та вибору стосовно оброблюваної нами інформації. З цією метою ми розробили справжню Політику конфіденційності, де детальніше описані наші методи забезпечення конфіденційності при використанні або іншій взаємодії з нашим Веб-сайтом.
					Для отримання більш детальної інформації про правила та умови використання Веб-сайту, будь ласка, ознайомтеся з нашими Умовами надання послуг (надалі за текстом іменуються як “Умови”). Зверніть увагу, що справжня Політика конфіденційності є невід’ємною частиною Умов, а всі терміни повинні використовуватися у тих самих значеннях, що й визначені в Умовах, якщо інше не зазначено у цьому документі. Наша Політика конфіденційності та наші методи забезпечення конфіденційності відповідають Загальному регламенту захисту даних (2016/679) (надалі за текстом іменується як “GDPR)”, Національного закону, що передбачає захист фізичних осіб стосовно обробки персональних даних та вільного переміщення таких даних (Закон 125(I)/2018 Республіки Кіпр) та іншим застосовним нормативно-правовим актам у сфері захисту персональних даних.</p>
				</div>
				
				<div class="space-y-4" id="kek">
					<p class="text-white-200 text-2xl font-medium">1. Вступ</p>
					<p class="text-gray-100 text-sm font-light">Компанія “Maincast Limited”, зареєстрована за номером HE 386802, з наступною юридичною адресою: Продмоу 75, Ванвью Парквью хаус (Prodromou, 75, Oneworld Parkview house), поверх 3, офіс 304, 2063, Нікосія, Кіпр, разом з її дочірніми компаніями (афілійованими особами), філіями, співробітниками, посадовими особами та директорами в залежності від ситуації (надалі за текстом іменуються як “Maincast”, “Компанія”, “ми”, “нас”, “наш”), є компанією, яка надає послуги з організації кіберспортивних заходів, що разом із функціями та послугами, які надаються, визначаються та надалі за текстом іменуються як “Послуги”.
					<br />
					<br />
					Компанія поважає конфіденційність своїх користувачів (надалі за текстом іменуються як “ви”, “ваш”). Ми вважаємо важливим, щоб ви приймали обґрунтовані рішення щодо використання наших Послуг на основі вашого розуміння, яку саме інформацію ми збираємо при використанні нашого Веб-сайту, що ми робимо з такою інформацією, як ми її обробляємо, яким особам ми її передаємо, а також щодо ваших прав та вибору стосовно оброблюваної нами інформації. З цією метою ми розробили справжню Політику конфіденційності, де детальніше описані наші методи забезпечення конфіденційності при використанні або іншій взаємодії з нашим Веб-сайтом.
					Для отримання більш детальної інформації про правила та умови використання Веб-сайту, будь ласка, ознайомтеся з нашими Умовами надання послуг (надалі за текстом іменуються як “Умови”). Зверніть увагу, що справжня Політика конфіденційності є невід’ємною частиною Умов, а всі терміни повинні використовуватися у тих самих значеннях, що й визначені в Умовах, якщо інше не зазначено у цьому документі. Наша Політика конфіденційності та наші методи забезпечення конфіденційності відповідають Загальному регламенту захисту даних (2016/679) (надалі за текстом іменується як “GDPR)”, Національного закону, що передбачає захист фізичних осіб стосовно обробки персональних даних та вільного переміщення таких даних (Закон 125(I)/2018 Республіки Кіпр) та іншим застосовним нормативно-правовим актам у сфері захисту персональних даних.</p>
				</div>
				
				<div class="space-y-4" id="lol">
					<p class="text-white-200 text-2xl font-medium">1. Вступ</p>
					<p class="text-gray-100 text-sm font-light">Компанія “Maincast Limited”, зареєстрована за номером HE 386802, з наступною юридичною адресою: Продмоу 75, Ванвью Парквью хаус (Prodromou, 75, Oneworld Parkview house), поверх 3, офіс 304, 2063, Нікосія, Кіпр, разом з її дочірніми компаніями (афілійованими особами), філіями, співробітниками, посадовими особами та директорами в залежності від ситуації (надалі за текстом іменуються як “Maincast”, “Компанія”, “ми”, “нас”, “наш”), є компанією, яка надає послуги з організації кіберспортивних заходів, що разом із функціями та послугами, які надаються, визначаються та надалі за текстом іменуються як “Послуги”.
					<br />
					<br />
					Компанія поважає конфіденційність своїх користувачів (надалі за текстом іменуються як “ви”, “ваш”). Ми вважаємо важливим, щоб ви приймали обґрунтовані рішення щодо використання наших Послуг на основі вашого розуміння, яку саме інформацію ми збираємо при використанні нашого Веб-сайту, що ми робимо з такою інформацією, як ми її обробляємо, яким особам ми її передаємо, а також щодо ваших прав та вибору стосовно оброблюваної нами інформації. З цією метою ми розробили справжню Політику конфіденційності, де детальніше описані наші методи забезпечення конфіденційності при використанні або іншій взаємодії з нашим Веб-сайтом.
					Для отримання більш детальної інформації про правила та умови використання Веб-сайту, будь ласка, ознайомтеся з нашими Умовами надання послуг (надалі за текстом іменуються як “Умови”). Зверніть увагу, що справжня Політика конфіденційності є невід’ємною частиною Умов, а всі терміни повинні використовуватися у тих самих значеннях, що й визначені в Умовах, якщо інше не зазначено у цьому документі. Наша Політика конфіденційності та наші методи забезпечення конфіденційності відповідають Загальному регламенту захисту даних (2016/679) (надалі за текстом іменується як “GDPR)”, Національного закону, що передбачає захист фізичних осіб стосовно обробки персональних даних та вільного переміщення таких даних (Закон 125(I)/2018 Республіки Кіпр) та іншим застосовним нормативно-правовим актам у сфері захисту персональних даних.</p>
				</div>
		
			</div>
			
			<div class="absolute bottom-0 h-6 w-full bg-gradient-to-t from-gray-800"></div>

			
		</div>

	
		<footer class="flex flex-col lg:flex-row gap-4 lg:gap-6 px-3 lg:px-6 py-4 lg:py-3 text-sm font-light bg-gray-900 text-gray-100">
			  <p><a href="#" class="hover:text-blue-200 active:text-blue-300">Угода користувача</a></p>
			  <p><a href="#" class="text-gray-100 hover:text-blue-200 active:text-blue-300">Політика конфіденційності</a></p>
			  <p class="flex flex-row gap-x-3"><span>Підтримка:</span><a href="#" class="hover:text-blue-200 active:text-blue-300">support@mctv.com.ua</a></p>
			  <p class="grow lg:order-first">© 2024 <a href="#" class="hover:text-blue-200 active:text-blue-300">Maincast</a>. Всі права захищено.</p>
		 </footer>
	</div>
	
	
	
	

	

  <script>
	  const { createApp, ref } = Vue
	  
	  createApp({
		setup() {
		  const message = ref('TV')
		  return {
			message
		  }
		}
	  }).mount('#app')
  </script>
  
  <script>
	  
	  function temp() {

		   console.log("🎃");
		   var iframe = document.getElementById("cosmoPlayer_html5_api");
		   console.log(iframe)
		}
	  
	  function access() {
		  console.log("🎃🎃🎃");

		  var iframe = document.getElementById("cosmoPlayer_html5_api");

		 var iframe = document.getElementById("cosmoframe");
		 
		 console.log(iframe);
		 var innerDoc = iframe.contentDocument || iframe.contentWindow.document;
		 
		 console.log(innerDoc.body);
		 
		 var _temp = innerDoc.getElementById("cosmoPlayer_html5_api");
		 
		 console.log("🎃🎃");

		 console.log(_temp);
		 console.log("🎃🎃");

		 // alert(123);
	  }
	  
	var _cosmoframe = document.getElementById("cosmoframe");
	const width = document.getElementById('cosmoframe').parentNode.clientWidth;
	  const height = Math.floor((width * 9)/16);
	_cosmoframe.setAttribute("style", "border:0; overflow: hidden; width:" + width + "px; height:" + height + "px;");
	_cosmoframe.setAttribute("autoplay", "autoplay");

	_cosmoframe.contentWindow.location.href = "https://live-maincast.cosmonova-broadcast.tv/player";
	
	var elmnt = _cosmoframe.contentWindow.document.getElementsByTagName("video");

	
	var _t = document.getElementById("cosmoPlayer_html5_api");

	console.log("!!!");

	console.log(elmnt);
  </script>
  
</body>
</html>